## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.azure[0].azurerm_container_app.main will be created
  + resource "azurerm_container_app" "main" {
      + container_app_environment_id  = "/subscriptions/3bb62e15-f34e-4c78-a2ac-2e7e4432446e/resourceGroups/lead-scoring-dev-rg/providers/Microsoft.App/managedEnvironments/lead-scoring-env"
      + custom_domain_verification_id = (sensitive value)
      + id                            = (known after apply)
      + latest_revision_fqdn          = (known after apply)
      + latest_revision_name          = (known after apply)
      + location                      = (known after apply)
      + name                          = "lead-scoring-app"
      + outbound_ip_addresses         = (known after apply)
      + resource_group_name           = "lead-scoring-dev-rg"
      + revision_mode                 = "Single"
      + tags                          = {
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Project"     = "lead-scoring"
        }

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }

      + ingress {
          + allow_insecure_connections = false
          + external_enabled           = true
          + fqdn                       = (known after apply)
          + target_port                = 8000
          + transport                  = "auto"

          + traffic_weight {
              + latest_revision = true
              + percentage      = 100
            }
        }

      + registry {
          + password_secret_name = "registry-password"
          + server               = "leadscoringdevacr.azurecr.io"
          + username             = "leadscoringdevacr"
        }

      + secret {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
      + secret {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }

      + template {
          + max_replicas    = 10
          + min_replicas    = 2
          + revision_suffix = (known after apply)

          + container {
              + cpu               = 0.5
              + ephemeral_storage = (known after apply)
              + image             = "leadscoringdevacr.azurecr.io/lead-scoring:latest"
              + memory            = "1Gi"
              + name              = "api"

              + env {
                  + name  = "ENV"
                  + value = "dev"
                }
              + env {
                  + name  = "LOG_LEVEL"
                  + value = "INFO"
                }
              + env {
                  + name  = "MODEL_ENDPOINT_PROVIDER"
                  + value = "local"
                }
              + env {
                  + name        = "API_KEYS"
                  + secret_name = "api-keys"
                }
              + env {
                  + name  = "APPLICATIONINSIGHTS_CONNECTION_STRING"
                  + value = (sensitive value)
                }
              + env {
                  + name = "AZURE_ML_ENDPOINT_URL"
                }
              + env {
                  + name = "AZURE_ML_API_KEY"
                }

              + liveness_probe {
                  + failure_count_threshold          = 3
                  + initial_delay                    = 10
                  + interval_seconds                 = 30
                  + path                             = "/health/live"
                  + port                             = 8000
                  + termination_grace_period_seconds = (known after apply)
                  + timeout                          = 5
                  + transport                        = "HTTP"
                }

              + readiness_probe {
                  + failure_count_threshold = 3
                  + interval_seconds        = 10
                  + path                    = "/health/ready"
                  + port                    = 8000
                  + success_count_threshold = 3
                  + timeout                 = 3
                  + transport               = "HTTP"
                }
            }

          + http_scale_rule {
              + concurrent_requests = "100"
              + name                = "http-scaling"
            }
        }
    }

  # module.azure[0].azurerm_key_vault_access_policy.container_app will be created
  + resource "azurerm_key_vault_access_policy" "container_app" {
      + id                 = (known after apply)
      + key_vault_id       = "/subscriptions/3bb62e15-f34e-4c78-a2ac-2e7e4432446e/resourceGroups/lead-scoring-dev-rg/providers/Microsoft.KeyVault/vaults/leadscoringdevkv"
      + object_id          = (known after apply)
      + secret_permissions = [
          + "Get",
          + "List",
        ]
      + tenant_id          = "caea166a-0dc6-4b8c-8322-c104d06a8244"
    }

  # module.azure[0].azurerm_monitor_metric_alert.high_cpu will be created
  + resource "azurerm_monitor_metric_alert" "high_cpu" {
      + auto_mitigate            = true
      + description              = "Alert when CPU usage is high"
      + enabled                  = true
      + frequency                = "PT5M"
      + id                       = (known after apply)
      + name                     = "lead-scoring-high-cpu"
      + resource_group_name      = "lead-scoring-dev-rg"
      + scopes                   = (known after apply)
      + severity                 = 2
      + tags                     = {
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Project"     = "lead-scoring"
        }
      + target_resource_location = (known after apply)
      + target_resource_type     = (known after apply)
      + window_size              = "PT15M"

      + criteria {
          + aggregation            = "Average"
          + metric_name            = "CpuPercentage"
          + metric_namespace       = "Microsoft.App/containerApps"
          + operator               = "GreaterThan"
          + skip_metric_validation = false
          + threshold              = 80
        }
    }

  # module.azure[0].azurerm_monitor_metric_alert.high_memory will be created
  + resource "azurerm_monitor_metric_alert" "high_memory" {
      + auto_mitigate            = true
      + description              = "Alert when memory usage is high"
      + enabled                  = true
      + frequency                = "PT5M"
      + id                       = (known after apply)
      + name                     = "lead-scoring-high-memory"
      + resource_group_name      = "lead-scoring-dev-rg"
      + scopes                   = (known after apply)
      + severity                 = 2
      + tags                     = {
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Project"     = "lead-scoring"
        }
      + target_resource_location = (known after apply)
      + target_resource_type     = (known after apply)
      + window_size              = "PT15M"

      + criteria {
          + aggregation            = "Average"
          + metric_name            = "MemoryPercentage"
          + metric_namespace       = "Microsoft.App/containerApps"
          + operator               = "GreaterThan"
          + skip_metric_validation = false
          + threshold              = 80
        }
    }

Plan: 4 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + api_url                              = (known after apply)
  + azure_api_url                        = (known after apply)
```
</details>